In [1]:
import pandas as pd

In [3]:
#series dataframe

In [8]:
s1 = pd.Series([1,2,3,4])
s1

0    1
1    2
2    3
3    4
dtype: int64

In [9]:
s2 = pd.Series([1,2,3,4],index = ['a','b','c','d'])
s2

a    1
b    2
c    3
d    4
dtype: int64

In [10]:
s1[1]

2

In [12]:
s2['a']

1

In [14]:
s2[['a','c']]

a    1
c    3
dtype: int64

In [15]:
s2['e'] = 6

In [16]:
s2

a    1
b    2
c    3
d    4
e    6
dtype: int64

In [17]:
dic = {'a':'name','b':'gender'}

In [19]:
s3 = pd.Series(dic,index = ['a','b','c'])

In [20]:
s3

a      name
b    gender
c       NaN
dtype: object

In [21]:
s2.astype('str')

a    1
b    2
c    3
d    4
e    6
dtype: object

In [22]:
s2

a    1
b    2
c    3
d    4
e    6
dtype: int64

In [24]:
s2 = s2.astype('str')

In [25]:
s2

a    1
b    2
c    3
d    4
e    6
dtype: object

In [26]:
s1

0    1
1    2
2    3
3    4
dtype: int64

In [27]:
#注意Series或者dataframe里面的数据类型必须是统一的，如果在全是数值的series加入一个字符串，那么全部都会变成字符串。
s1['a'] = 'A'

In [28]:
s1

0    1
1    2
2    3
3    4
a    A
dtype: object

In [36]:
d = {'name':['ao','wa','yeah'],'gender':['female','male','male'],'age':[10,20,30]}
df = pd.DataFrame(d)
df

   name  gender  age
0    ao  female   10
1    wa    male   20
2  yeah    male   30

In [42]:
#pd.DataFrame([[1,2,3,4],[5,6,7,8]],columns =list('abcd'))

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
name      3 non-null object
gender    3 non-null object
age       3 non-null int64
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [40]:
#!单列切片，数据类型会从dataframe变为series
df['age']

0    10
1    20
2    30
Name: age, dtype: int64

In [41]:
#基于行的切片
df.iloc[0]

name          ao
gender    female
age           10
Name: 0, dtype: object

In [49]:
#多列切片，需要在索引里使用列表进行切片,后面0到2代表行，并且2是开区间，取不到。
df[['age','gender']][0:2]

   age  gender
0   10  female
1   20    male

In [51]:
df['age'][0] = 18

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [52]:
df

   name  gender  age
0    ao  female   18
1    wa    male   20
2  yeah    male   30

In [53]:
df['age'] = [18,19,20]

In [54]:
df

   name  gender  age
0    ao  female   18
1    wa    male   19
2  yeah    male   20

In [56]:
df.index = list('abc')
df

   name  gender  age
a    ao  female   18
b    wa    male   19
c  yeah    male   20

In [57]:
df.index = [0,1,2]